In [ ]:
"""
topics learn in this notebook

add columns(single/multiple)
    df
    insert
    assign
add rows(single/multiple)
    df.loc[len(df.index)]
    pd.concat
remove columns(single/multiple)
    drop(columns=)
remove rows(single/multiple)
    drop(index=)
str.split()
"""

In [79]:
people = {
    'first': ['Corey', 'Jane', 'John'], 
    'last': ['Schafer', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com']
}

In [80]:
import pandas as pd

In [81]:
df = pd.DataFrame(people)

In [82]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [83]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [84]:
df['full_name'] = df['first'] + ' ' + df['last']

In [85]:
df

   first     last                    email      full_name
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer
1   Jane      Doe        JaneDoe@email.com       Jane Doe
2   John      Doe        JohnDoe@email.com       John Doe

insert()

In [86]:
#add a column using insert
df.insert(4,"city",["NRT","GNT","HYD"],True)

In [87]:
df

   first     last                    email      full_name city
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  NRT
1   Jane      Doe        JaneDoe@email.com       Jane Doe  GNT
2   John      Doe        JohnDoe@email.com       John Doe  HYD

assign()

In [88]:
# Using 'state' as the column name and equating it to the list
df.assign(state = ['Andhra Pradesh', 'Andhra Pradesh', 'Andhra Pradesh'])

   first     last                    email      full_name city           state
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  NRT  Andhra Pradesh
1   Jane      Doe        JaneDoe@email.com       Jane Doe  GNT  Andhra Pradesh
2   John      Doe        JohnDoe@email.com       John Doe  HYD  Andhra Pradesh

adding multiple columns

In [89]:
#adding multiple columns
df = df.assign(Technology = ["sql","java","python"],DOJ=['01-02-2023','15-02-2023','28-02-2023'])

In [90]:
df

,first,last,email,full_name,city,Technology,DOJ
0,Corey,Schafer,CoreyMSchafer@gmail.com,Corey Schafer,NRT,sql,01-02-2023
1,Jane,Doe,JaneDoe@email.com,Jane Doe,GNT,java,15-02-2023
2,John,Doe,JohnDoe@email.com,John Doe,HYD,python,28-02-2023

dropping columns

In [91]:
#dropping single column

df.drop(columns='DOJ', inplace=True)

In [92]:
df

   first     last                    email      full_name city Technology
0  Corey  Schafer  CoreyMSchafer@gmail.com  Corey Schafer  NRT        sql
1   Jane      Doe        JaneDoe@email.com       Jane Doe  GNT       java
2   John      Doe        JohnDoe@email.com       John Doe  HYD     python

In [93]:
#dropping multiple column
df.drop(columns=['first', 'last'], inplace=True)

In [94]:
df

                     email      full_name city Technology
0  CoreyMSchafer@gmail.com  Corey Schafer  NRT        sql
1        JaneDoe@email.com       Jane Doe  GNT       java
2        JohnDoe@email.com       John Doe  HYD     python

In [95]:
df['full_name'].str.split(' ',expand=True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [96]:
df[['first','last']] = df['full_name'].str.split(' ',expand=True)

In [97]:
df

                     email      full_name city Technology  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  NRT        sql  Corey  Schafer
1        JaneDoe@email.com       Jane Doe  GNT       java   Jane      Doe
2        JohnDoe@email.com       John Doe  HYD     python   John      Doe

In [98]:
#adding  single row
df.loc[len(df.index)] = ['lakshmisettycharan@gmail.com','Laksmisetty Charan','NRT','R','lakshmisetty','charan']

In [99]:
df

,email,full_name,city,Technology,first,last
0,CoreyMSchafer@gmail.com,Corey Schafer,NRT,sql,Corey,Schafer
1,JaneDoe@email.com,Jane Doe,GNT,java,Jane,Doe
2,JohnDoe@email.com,John Doe,HYD,python,John,Doe
3,lakshmisettycharan@gmail.com,Laksmisetty Charan,NRT,R,lakshmisetty,charan

In [100]:
#adding multiple rows

people1 = {'email':['pavankumarsriram@gmail.com','udaybhasker@gmail.com'],
           'full_name':['pavan kumar sriram','uday bhasker allugumalli'],
           'city':['RJY','EG'],
           'Technology':['C','Javascript'],
           'first':['pavan kumar','uday bhasker'],
           'last':['sriram','allugumalli'] 
           }

df1 = pd.DataFrame(people1)


df1

,email,full_name,city,Technology,first,last
0,pavankumarsriram@gmail.com,pavan kumar sriram,RJY,C,pavan kumar,sriram
1,udaybhasker@gmail.com,uday bhasker allugumalli,EG,Javascript,uday bhasker,allugumalli

In [101]:
df =pd.concat([df,df1],ignore_index=True)

In [102]:
df

,email,full_name,city,Technology,first,last
0,CoreyMSchafer@gmail.com,Corey Schafer,NRT,sql,Corey,Schafer
1,JaneDoe@email.com,Jane Doe,GNT,java,Jane,Doe
2,JohnDoe@email.com,John Doe,HYD,python,John,Doe
3,lakshmisettycharan@gmail.com,Laksmisetty Charan,NRT,R,lakshmisetty,charan
4,pavankumarsriram@gmail.com,pavan kumar sriram,RJY,C,pavan kumar,sriram
5,udaybhasker@gmail.com,uday bhasker allugumalli,EG,Javascript,uday bhasker,allugumalli

In [103]:
#dropping rows

df.drop(index=4,inplace=True)

In [104]:
df

,email,full_name,city,Technology,first,last
0,CoreyMSchafer@gmail.com,Corey Schafer,NRT,sql,Corey,Schafer
1,JaneDoe@email.com,Jane Doe,GNT,java,Jane,Doe
2,JohnDoe@email.com,John Doe,HYD,python,John,Doe
3,lakshmisettycharan@gmail.com,Laksmisetty Charan,NRT,R,lakshmisetty,charan
5,udaybhasker@gmail.com,uday bhasker allugumalli,EG,Javascript,uday bhasker,allugumalli

In [105]:
df.drop(index=[3,5],inplace=True)

In [106]:
df

                     email      full_name city Technology  first     last
0  CoreyMSchafer@gmail.com  Corey Schafer  NRT        sql  Corey  Schafer
1        JaneDoe@email.com       Jane Doe  GNT       java   Jane      Doe
2        JohnDoe@email.com       John Doe  HYD     python   John      Doe